CITIES_LINK = (
    'https://ru.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%B3'
    '%D0%BE%D1%80%D0%BE%D0%B4%D0%BE%D0%B2_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
    '_%D1%81_%D0%BD%D0%B0%D1%81%D0%B5%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5%D0%BC_%D0%'
    'B1%D0%BE%D0%BB%D0%B5%D0%B5_100_%D1%82%D1%8B%D1%81%D1%8F%D1%87_%D0%B6%D0%B'
    '8%D1%82%D0%B5%D0%BB%D0%B5%D0%B9'
)


CITY_LIST = [
    'Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань',
    'Красноярск', 'Нижний Новгород', 'Челябинск', 'Уфа', 'Самара',
    'Ростов-на-Дону', 'Краснодар', 'Омск', 'Воронеж', 'Пермь', 'Волгоград',
    'Саратов', 'Тюмень', 'Тольятти', 'Махачкала', 'Барнаул', 'Ижевск',
    'Хабаровск', 'Ульяновск', 'Иркутск', 'Владивосток', 'Ярославль',
    'Севастополь', 'Ставрополь', 'Томск', 'Кемерово', 'Набережные Челны',
    'Оренбург', 'Новокузнецк', 'Балашиха', 'Рязань', 'Чебоксары',
    'Калининград', 'Пенза', 'Липецк', 'Киров', 'Астрахань', 'Тула', 'Сочи',
    'Курск', 'Улан-Удэ', 'Сургут', 'Тверь', 'Магнитогорск', 'Брянск',
    'Якутск', 'Иваново', 'Владимир', 'Симферополь', 'Грозный', 'Чита',
    'Нижний Тагил', 'Калуга', 'Белгород', 'Волжский', 'Подольск',
    'Вологда', 'Саранск', 'Смоленск', 'Курган', 'Череповец', 'Архангельск',
    'Владикавказ', 'Орёл', 'Нижневартовск', 'Йошкар-Ола', 'Стерлитамак',
    'Мытищи', 'Мурманск', 'Кострома', 'Новороссийск', 'Химки', 'Тамбов',
    'Нальчик', 'Таганрог', 'Нижнекамск', 'Благовещенск', 'Люберцы',
    'Петрозаводск', 'Комсомольск-на-Амуре', 'Королёв', 'Энгельс',
    'Великий Новгород', 'Шахты', 'Братск', 'Сыктывкар', 'Ангарск',
    'Старый Оскол', 'Дзержинск', 'Красногорск', 'Орск', 'Одинцово', 'Псков',
    'Абакан', 'Армавир', 'Балаково', 'Бийск', 'Южно-Сахалинск', 'Уссурийск',
    'Норильск', 'Прокопьевск', 'Рыбинск', 'Волгодонск', 'Альметьевск',
    'Петропавловск-Камчатский', 'Сызрань', 'Каменск-Уральский', 'Новочеркасск',
    'Хасавюрт', 'Златоуст', 'Домодедово', 'Северодвинск', 'Керчь', 'Миасс',
    'Салават', 'Копейск', 'Пятигорск', 'Электросталь', 'Майкоп', 'Щёлково',
    'Находка', 'Березники', 'Нефтекамск', 'Серпухов', 'Обнинск', 'Коломна',
    'Кызыл', 'Каспийск', 'Ковров', 'Дербент', 'Нефтеюганск', 'Кисловодск',
    'Назрань', 'Батайск', 'Рубцовск', 'Ессентуки', 'Новочебоксарск',
    'Долгопрудный', 'Новомосковск', 'Октябрьский', 'Невинномысск',
    'Раменское', 'Черкесск', 'Мурино', 'Михайловск', 'Реутов',
    'Ханты-Мансийск', 'Первоуральск', 'Пушкино', 'Жуковский', 'Димитровград',
    'Артём', 'Новый Уренгой', 'Евпатория', 'Видное', 'Северск', 'Камышин',
    'Муром', 'Орехово-Зуево', 'Арзамас', 'Элиста', 'Ноябрьск', 'Бердск',
    'Ногинск', 'Новошахтинск'
]


USER_AGENTS = [
    'Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) '
    'Chrome/124.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like '
    'Gecko) Chrome/124.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, '
    'like Gecko) Chrome/124.0.0.0 Safari/537.36/537.36',
    'Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) '
    'Chrome/123.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like '
    'Gecko) Chrome/123.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, '
    'like Gecko) Chrome/123.0.0.0 Safari/537.36/537.36',
    'Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) '
    'Chrome/122.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like '
    'Gecko) Chrome/122.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, '
    'like Gecko) Chrome/122.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) '
    'Chrome/121.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like '
    'Gecko) Chrome/121.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, '
    'like Gecko) Chrome/121.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) '
    'Chrome/120.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like '
    'Gecko) Chrome/120.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, '
    'like Gecko) Chrome/120.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) '
    'Chrome/119.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like '
    'Gecko) Chrome/119.0.0.0 Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, '
    'like Gecko) Chrome/119.0.0.0 Safari/537.36'
]


PROXIES = [
    '38.154.227.167:5868:inulgvqm:drzeljplcnbh',
    '45.127.248.127:5128:inulgvqm:drzeljplcnbh',
    '64.64.118.149:6732:inulgvqm:drzeljplcnbh',
    '167.160.180.203:6754:inulgvqm:drzeljplcnbh',
    '166.88.58.10:5735:inulgvqm:drzeljplcnbh',
    '173.0.9.70:5653:inulgvqm:drzeljplcnbh',
    '45.151.162.198:6600:inulgvqm:drzeljplcnbh',
    '204.44.69.89:6342:inulgvqm:drzeljplcnbh',
    '173.0.9.209:5792:inulgvqm:drzeljplcnbh',
    '206.41.172.74:6634:inulgvqm:drzeljplcnbh'
]
